IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f280015x_dcc_regs.xml
<module id="DCC_REGS" HW_revision="" description="DCC Registers">
	<register id="DCCGCTRL" width="32" page="1" offset="0x0" internal="0" description="Starts / stops the counters. Clears the error signal.">
		<bitfield id="DCCENA" description="DCC Enable" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="ERRENA" description="Error Enable" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="SINGLESHOT" description="Single-Shot Enable" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="DONEENA" description="DONE Enable" begin="15" end="12" width="4" rwaccess="RW"/>
	</register>
	<register id="DCCCNTSEED0" width="32" page="1" offset="0x8" internal="0" description="Seed value for the counter attached to Clock Source 0.">
		<bitfield id="COUNTSEED0" description="Seed Value for Counter 0" begin="19" end="0" width="20" rwaccess="RW"/>
	</register>
	<register id="DCCVALIDSEED0" width="32" page="1" offset="0xc" internal="0" description="Seed value for the timeout counter attached to Clock Source 0.">
		<bitfield id="VALIDSEED" description="Seed Value for Valid Duration Counter 0" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="DCCCNTSEED1" width="32" page="1" offset="0x10" internal="0" description="Seed value for the counter attached to Clock Source 1.">
		<bitfield id="COUNTSEED1" description="Seed Value for Counter 1" begin="19" end="0" width="20" rwaccess="RW"/>
	</register>
	<register id="DCCSTATUS" width="32" page="1" offset="0x14" internal="0" description="Specifies the status of the DCC Module.">
		<bitfield id="ERR" description="Error Flag" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DONE" description="Single-Shot Done Flag" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="DCCCNT0" width="32" page="1" offset="0x18" internal="0" description="Value of the counter attached to Clock Source 0.">
		<bitfield id="COUNT0" description="Current Value of Counter 0" begin="19" end="0" width="20" rwaccess="R"/>
	</register>
	<register id="DCCVALID0" width="32" page="1" offset="0x1c" internal="0" description="Value of the valid counter attached to Clock Source 0.">
		<bitfield id="VALID0" description="Current Value of Valid 0" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="DCCCNT1" width="32" page="1" offset="0x20" internal="0" description="Value of the counter attached to Clock Source 1.">
		<bitfield id="COUNT1" description="Current Value of Counter 1" begin="19" end="0" width="20" rwaccess="R"/>
	</register>
	<register id="DCCCLKSRC1" width="32" page="1" offset="0x24" internal="0" description="Selects the clock source for Counter 1.">
		<bitfield id="CLKSRC1" description="Clock Source Select for Counter 1" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="KEY" description="Enables or Disables Clock Source Selection for COUNT1" begin="15" end="12" width="4" rwaccess="RW"/>
	</register>
	<register id="DCCCLKSRC0" width="32" page="1" offset="0x28" internal="0" description="Selects the clock source for Counter 0.">
		<bitfield id="CLKSRC0" description="Clock Source Select for Counter 0" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="KEY" description="Enables or Disables Clock Source Selection for COUNT0" begin="15" end="12" width="4" rwaccess="RW"/>
	</register>
</module>
